In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split 
from sklearn.metrics import accuracy_score

# Naive Bayes implementation practise
## First some feature engineering

In [2]:
url = 'https://raw.githubusercontent.com/umaimehm/Intro_to_AI/master/machinelearning-Lab4/Lab4/NaiveBayes/Example1/adult.csv'
df = pd.read_csv(url)

In [3]:
df.head(3)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K

In [4]:
df_adult = df.drop(['workclass','fnlwgt','educational-num','marital-status','race','capital-gain','capital-loss',
               'native-country'],axis=1)

In [5]:
df_adult.head(3)

,age,education,occupation,relationship,gender,hours-per-week,income
0,25,11th,Machine-op-inspct,Own-child,Male,40,<=50K
1,38,HS-grad,Farming-fishing,Husband,Male,50,<=50K
2,28,Assoc-acdm,Protective-serv,Husband,Male,40,>50K

In [6]:
df_adult.drop(['education','occupation','relationship'],axis=1,inplace=True)
df_adult.head(3)

   age gender  hours-per-week income
0   25   Male              40  <=50K
1   38   Male              50  <=50K
2   28   Male              40   >50K

In [7]:
input = df_adult.drop(['income'],axis='columns')
input.head()

   age  gender  hours-per-week
0   25    Male              40
1   38    Male              50
2   28    Male              40
3   44    Male              40
4   18  Female              30

In [8]:
genders = pd.get_dummies(df_adult.gender)

In [9]:
genders.head()

   Female  Male
0       0     1
1       0     1
2       0     1
3       0     1
4       1     0

In [10]:
target = df['income']
target.head()

0    <=50K
1    <=50K
2     >50K
3     >50K
4    <=50K
Name: income, dtype: object

In [11]:
input.drop(['gender'],axis='columns', inplace = True)

In [12]:
input.head(3)

   age  hours-per-week
0   25              40
1   38              50
2   28              40